**Prithibi Paul | Group 6 | Questions 4 and 5**

**Question 4:**

In [ ]:
-- Question 4: 
-- Return orders with total value(qty*unitprice) greater than 10000
-- sorted by total value
-- Tables involved: Sales.OrderDetails table

-- Desired output:
orderid     totalvalue
----------- ---------------------
10865       17250.00
11030       16321.90
10981       15810.00
10372       12281.20
10424       11493.20
10817       11490.70
10889       11380.00
10417       11283.20
10897       10835.24
10353       10741.60
10515       10588.50
10479       10495.60
10540       10191.70
10691       10164.80

(14 row(s) affected)

**<u>Explanation for the TSQLV4 Database Query</u>**

1\. Database Context: 'USE \[TSQLV4\]' sets the context to the TSQLV4 database.

2\. SELECT Clause:

   - 'od.orderid': Selects the order ID from the \[Sales\].\[OrderDetails\] table.

   - 'SUM(od.qty \* od.unitprice) AS totalvalue': Calculates the total value of each order by multiplying quantity (od.qty) by unit price (od.unitprice) and summing these products, aliasing the result as 'totalvalue'.

3\. FROM Clause:

   - Specifies the \[Sales\].\[OrderDetails\] table as the data source, aliasing it as 'od'.

4\. GROUP BY Clause:

   - Groups the results by 'od.orderid' to apply the SUM function to each unique order ID.

5\. HAVING Clause:

   - Filters the results to include only those groups where the total value exceeds 10,000.

6\. ORDER BY Clause:

   - Sorts the resulting order IDs by their calculated total value in descending order.

**<u>Explanation for the Northwinds2022TSQLV7 Database Query</u>**

1\. Database Context: 'USE \[Northwinds2022TSQLV7\]' switches context to operate on the Northwinds2022TSQLV7 database.

2\. SELECT Clause:

   - 'od.OrderId': Selects the Order ID from the \[Sales\].\[OrderDetail\] table.

   - 'SUM(od.Quantity \* od.UnitPrice) AS totalvalue': Calculates the total value for each order by multiplying 'od.Quantity' by 'od.UnitPrice', aliasing the result as 'totalvalue'.

3\. FROM Clause:

   - Specifies the \[Sales\].\[OrderDetail\] table as the data source, using 'od' as an alias.

4\. GROUP BY Clause:

   - Groups the data by 'od.OrderId'.

5\. HAVING Clause:

   - Filters to include only those orders where the total value is more than 10,000.

6\. ORDER BY Clause:

   - Orders the results by the 'totalvalue' in descending order.

Summary: Both queries are structured to identify and list orders with a total value greater than 10,000 in their respective databases. They perform this by grouping order details by order ID, calculating the total value for each group, and filtering and sorting the results based on this calculated total value. Despite similar structures, each query is tailored to the specific table and column names of its respective database.

In [7]:
USE [TSQLV4]
GO

-- Calculating total value of orders greater than 10000 in TSQLV4 database
SELECT 
    od.orderid, 
    SUM(od.qty * od.unitprice) AS totalvalue -- Calculating total value
FROM 
    [Sales].[OrderDetails] as od
GROUP BY 
    od.orderid
HAVING 
    SUM(od.qty * od.unitprice) > 10000 
    -- Filtering orders with total value greater than 10000
ORDER BY 
    totalvalue DESC; -- Sorting by total value in descending order


USE [Northwinds2022TSQLV7]
GO

-- Calculating total value of orders greater than 10000 in Northwinds2022TSQLV7 database
SELECT 
    od.OrderId, 
    SUM(od.Quantity * od.UnitPrice) AS totalvalue -- Calculating total value
FROM 
    [Sales].[OrderDetail] as od
GROUP BY 
    od.OrderId
HAVING 
    SUM(od.Quantity * od.UnitPrice) > 10000 -- Filtering orders with total value greater than 10000
ORDER BY 
    totalvalue DESC; -- Sorting by total value in descending order

orderid,totalvalue
10865,17250.00
11030,16321.90
10981,15810.00
10372,12281.20
10424,11493.20
10817,11490.70
10889,11380.00
10417,11283.20
10897,10835.24
10353,10741.60
10515,10588.50
10479,10495.60
10540,10191.70
10691,10164.80

OrderId,totalvalue
10865,17250.00
11030,16321.90
10981,15810.00
10372,12281.20
10424,11493.20
10817,11490.70
10889,11380.00
10417,11283.20
10897,10835.24
10353,10741.60
10515,10588.50
10479,10495.60
10540,10191.70
10691,10164.80

**Question 5:**

In [ ]:
-- Question 5: 
-- Write a query against the HR.Employees table that returns employees
-- with a last name that starts with a lower case letter.
-- Remember that the collation of the sample database
-- is case insensitive (Latin1_General_CI_AS).
-- For simplicity, you can assume that only English letters are used
-- in the employee last names.
-- Tables involved: Sales.OrderDetails table

-- Desired output:
empid       lastname
----------- --------------------

(0 row(s) affected)

**<u>Explanation for the TSQLV4 Database Query</u>**

1\. Database Context: 'USE TSQLV4' sets the context to the TSQLV4 database.

2\. SELECT Clause:

   - 'empid': Selects the employee ID from the HR.Employees table.

   - 'lastname': Selects the last name of the employee from the HR.Employees table.

3\. FROM Clause:

   - Specifies the HR.Employees table as the data source.

4\. WHERE Clause:

   - 'lastname COLLATE Latin1\_General\_BIN LIKE N'\[a-z\]%'' : Filters the data to include only those employees whose last name starts with a lowercase letter. 

     The COLLATE Latin1\_General\_BIN clause is used to enforce binary collation for case sensitivity, which is necessary due to the case-insensitive nature of the database's collation setting (Latin1\_General\_CI\_AS).

**<u>Explanation for the Northwinds2022TSQLV7 Database Query</u>**

1\. Database Context: 'USE Northwinds2022TSQLV7' switches context to operate on the Northwinds2022TSQLV7 database.

2\. SELECT Clause:

   - 'EmployeeId': Selects the employee ID from the HumanResources.Employee table.

   - 'EmployeeLastName': Selects the last name of the employee from the HumanResources.Employee table.

3\. FROM Clause:

   - Specifies the HumanResources.Employee table as the data source.

4\. WHERE Clause:

   - 'EmployeeLastName COLLATE Latin1\_General\_BIN LIKE N'\[a-z\]%'' : Filters the data to include only those employees whose last name starts with a lowercase letter. 

     The COLLATE Latin1\_General\_BIN clause is used here as well to enforce binary collation for case sensitivity in a case-insensitive collation environment.

  

Summary: Both queries are designed to retrieve employee records where the last name begins with a lowercase letter from their respective databases. This is achieved by enforcing case sensitivity through the use of binary collation (Latin1\_General\_BIN) in the WHERE clause. Each query is tailored to the specific table and column names of its respective database.

In [6]:
-- Query for the TSQLV4 database
USE TSQLV4
GO

-- Retrieving employees from HR.Employees where the last name starts with a lowercase letter.
-- The database uses case-insensitive collation
SELECT 
    empid, 
    lastname 
FROM 
    HR.Employees 
WHERE 
    lastname COLLATE Latin1_General_BIN LIKE N'[a-z]%';


-- Query for the Northwinds2022TSQLV7 database
USE Northwinds2022TSQLV7
GO

-- Retrieving employees from HumanResources.Employee where the EmployeeLastName starts with a lowercase letter.
-- The database uses case-insensitive collation
SELECT 
    EmployeeId, 
    EmployeeLastName 
FROM 
    HumanResources.Employee 
WHERE 
    EmployeeLastName COLLATE Latin1_General_BIN LIKE N'[a-z]%';

**Part 2 of Hw - Prithibi Paul**  
**Chapter 02 - Single-Table Queries**

```
---------------------------------------------------------------------
-- Working with Date and Time Data
---------------------------------------------------------------------
```

<span style="color: var(--vscode-foreground);">Question:</span>  

  

Create a query for the \`Sales.Order\` table to display \`Order ID\`, \`Customer ID\`, \`Employee ID\`, and \`Order Date\`. 

The query should only show orders where the \`Order Date\` is '20160212'. 

You can use \`CAST\` to convert the string '20160212' into a date type, 

or you can directly use the string '20160212' as SQL will automatically interpret it as a date.  
  

Table involved: \`Sales.Order\`

In [ ]:
-- Literals
SELECT orderid, custid, empid, orderdate
FROM Sales.Orders
WHERE orderdate = '20160212';

SELECT orderid, custid, empid, orderdate
FROM Sales.Orders
WHERE orderdate = CAST('20160212' AS DATE);

Question:

  

Write two SQL queries to demonstrate how the interpretation of a date string can vary based on the language setting. The first query should set the language to British and convert the string '02/12/2016' into a DATE type. The second query should set the language to US English and perform the same conversion. Compare the results to illustrate the difference in date format interpretation between British and US English settings.

  

Note: In British language setting, the date format is assumed to be 'dd/mm/yyyy', while in US English, it is 'mm/dd/yyyy'.

In [ ]:
-- Language dependent
SET LANGUAGE British;
SELECT CAST('02/12/2016' AS DATE);

SET LANGUAGE us_english;
SELECT CAST('02/12/2016' AS DATE);

Question:

  

Demonstrate the concept of language-neutral date conversions in SQL. Write a series of SQL queries to illustrate how different date strings are interpreted and converted into a DATE type under various settings and functions. Your tasks should include:

  

1\. Setting the language to British and converting the string '20160212' into a DATE type.

2\. Setting the language to US English and performing the same conversion for '20160212'.

3\. Using CONVERT to change '02/12/2016' into a DATE type with style 101 (U.S. format mm/dd/yyyy).

4\. Using CONVERT to change '02/12/2016' into a DATE type with style 103 (British/French format dd/mm/yyyy).

5\. Using PARSE to interpret '02/12/2016' as a DATE in US English ('en-US').

6\. Using PARSE to interpret '02/12/2016' as a DATE in British English ('en-GB').

  

This exercise aims to show how SQL handles dates in a language-neutral manner and how the interpretation of date strings can vary based on the function and style used, independent of the SET LANGUAGE setting.

In [ ]:
-- Language neutral
SET LANGUAGE British;
SELECT CAST('20160212' AS DATE);

SET LANGUAGE us_english;
SELECT CAST('20160212' AS DATE);

SELECT CONVERT(DATE, '02/12/2016', 101);

SELECT CONVERT(DATE, '02/12/2016', 103);

SELECT PARSE('02/12/2016' AS DATE USING 'en-US');

SELECT PARSE('02/12/2016' AS DATE USING 'en-GB');

Question:

As part of a database management task, you are required to work with date and time data in your SQL database. Your specific task involves the \`Sales.Orders\` table. You need to create a new table named \`Sales.Orders2\` which will include data from \`Sales.Orders\`, but with a modification in the format of the date data. Follow these steps:

1\. First, check if a table named \`Sales.Orders2\` already exists in the database. If such a table exists, drop it to avoid any conflicts or duplications.

2\. Create the \`Sales.Orders2\` table by selecting all records from the \`Sales.Orders\` table. The key difference in the new table should be the format of the \`orderdate\` field. In \`Sales.Orders2\`, ensure that the \`orderdate\` is stored as a DATETIME type, rather than its current format in the \`Sales.Orders\` table. Remember to include the fields \`orderid\`, \`custid\`, and \`empid\` in the new table, alongside the converted \`orderdate\`.

3\. Once you have created the table, verify its structure and the successful data type conversion by querying and displaying a few sample rows from \`Sales.Orders2\`.

  

Your aim is to demonstrate your ability to manage and restructure data within SQL, particularly focusing on the correct handling and conversion of date and time data.

In [ ]:
-- Working with Date and Time Separately

-- Create Sales.Orders2 with orderdate as DATETIME by copying data from Sales.Orders
DROP TABLE IF EXISTS Sales.Orders2;

SELECT orderid, custid, empid, CAST(orderdate AS DATETIME) AS orderdate
INTO Sales.Orders2
FROM Sales.Orders;

Question:

Your task involves querying and modifying the \`Sales.Orders2\` table in your SQL database, with a focus on handling and constraining date and time data. Proceed with the following steps:

1\. Query the \`Sales.Orders2\` table to retrieve the \`orderid\`, \`custid\`, \`empid\`, and \`orderdate\` for all orders specifically made on the date '20160212'. This step requires accurate date filtering to ensure only records from that specific day are selected.

2\. Alter the \`Sales.Orders2\` table by adding a new constraint named \`CHK\_Orders2\_orderdate\`. This constraint should ensure that the time component of the \`orderdate\` in each record is exactly '00:00:00.000'. You will need to use the CONVERT function to achieve this, formatting the time part of the \`orderdate\` as CHAR(12) for comparison.

3\. After modifying the table, write another query to retrieve records from \`Sales.Orders2\` where the \`orderdate\` falls within the 24-hour period starting from '20160212' and ending before '20160213'. This requires precise date range filtering.

4\. As an additional task, demonstrate how to convert a time string '12:30:15.123' into a DATETIME format in SQL. This will help you understand how SQL interprets and converts standalone time strings to DATETIME values.

The goal of these tasks is to enhance your skills in querying date and time data in SQL, applying constraints for data validation, and understanding the conversion of time strings.

In [ ]:
-- Query Sales.Orders2
SELECT orderid, custid, empid, orderdate
FROM Sales.Orders2
WHERE orderdate = '20160212';

ALTER TABLE Sales.Orders2
  ADD CONSTRAINT CHK_Orders2_orderdate
  CHECK( CONVERT(CHAR(12), orderdate, 114) = '00:00:00:000' );

SELECT orderid, custid, empid, orderdate
FROM Sales.Orders2
WHERE orderdate >= '20160212'
  AND orderdate < '20160213';

SELECT CAST('12:30:15.123' AS DATETIME);

Question:

  

You are tasked with extracting specific sets of data from the \`Sales.Orders\` table in your SQL database, focusing on orders from particular time periods. Perform the following tasks:

  

1\. Before starting your data queries, ensure that your database is organized. If a table named \`Sales.Orders2\` exists, remove it to avoid any confusion or data redundancy.

  

2\. Query the \`Sales.Orders\` table to retrieve the \`orderid\`, \`custid\`, \`empid\`, and \`orderdate\` for all orders placed in the year 2015. You will need to use the YEAR function to correctly filter the orders by the year part of the \`orderdate\`.

  

3\. Next, adjust your query to select the same fields (\`orderid\`, \`custid\`, \`empid\`, and \`orderdate\`) from the \`Sales.Orders\` table, but this time for orders placed between January 1, 2015, and December 31, 2015, inclusive. You should consider the precise range of dates for this period.

  

4\. Modify your query to now focus on orders placed in February 2016. Extract the same fields as before, using the YEAR and MONTH functions to filter the data accordingly.

  

5\. Lastly, write a query to select orders from the \`Sales.Orders\` table where the \`orderdate\` falls within the entire month of February 2016, from February 1, 2016, to February 29, 2016.

  

Your goal is to demonstrate proficiency in querying date-specific data in a SQL database, particularly focusing on extracting information based on different year and month criteria.

In [ ]:
-- Cleanup
DROP TABLE IF EXISTS Sales.Orders2;

SELECT orderid, custid, empid, orderdate
FROM Sales.Orders
WHERE YEAR(orderdate) = 2015;

SELECT orderid, custid, empid, orderdate
FROM Sales.Orders
WHERE orderdate >= '20150101' AND orderdate < '20160101';

SELECT orderid, custid, empid, orderdate
FROM Sales.Orders
WHERE YEAR(orderdate) = 2016 AND MONTH(orderdate) = 2;

SELECT orderid, custid, empid, orderdate
FROM Sales.Orders
WHERE orderdate >= '20160201' AND orderdate < '20160301';

Question:

  

Demonstrate your understanding of various SQL functions used to retrieve the current date and time. Perform the following tasks:

  

1\. Write a SQL query to display the current date and time using different SQL functions. Your query should include the use of \`GETDATE()\`, \`CURRENT\_TIMESTAMP\`, \`GETUTCDATE()\`, \`SYSDATETIME()\`, \`SYSUTCDATETIME()\`, and \`SYSDATETIMEOFFSET()\`. Each function should be labeled appropriately in the output.

  

2\. Next, write another query that extracts just the current date and the current time from the \`SYSDATETIME()\` function. Use the \`CAST\` function to convert \`SYSDATETIME()\` to a DATE type and display it as \`\[current\_date\]\`, and similarly convert it to a TIME type and display it as \`\[current\_time\]\`.

  

The aim of these tasks is to illustrate your ability to use various SQL functions to retrieve and manipulate the current date and time, showcasing the versatility of SQL in handling datetime values.

In [ ]:
-- Functions

-- Current Date and Time
SELECT
  GETDATE()           AS [GETDATE],
  CURRENT_TIMESTAMP   AS [CURRENT_TIMESTAMP],
  GETUTCDATE()        AS [GETUTCDATE],
  SYSDATETIME()       AS [SYSDATETIME],
  SYSUTCDATETIME()    AS [SYSUTCDATETIME],
  SYSDATETIMEOFFSET() AS [SYSDATETIMEOFFSET];

SELECT
  CAST(SYSDATETIME() AS DATE) AS [current_date],
  CAST(SYSDATETIME() AS TIME) AS [current_time];

Question:

  

Explore the functionality and differences between the CAST, CONVERT, and PARSE functions in SQL, and understand how they are used in date and time manipulation. Perform the following tasks:

  

1\. Use the CAST function to convert the string '20160212' into a DATE type. Then, convert the current system datetime, obtained from \`SYSDATETIME()\`, into both a DATE and a TIME type separately using CAST.

  

2\. Utilize the CONVERT function to transform the current timestamp (\`CURRENT\_TIMESTAMP\`) into a string in the format 'yyyymmdd' (style 112). Next, convert this string back into a DATETIME type using the same style code. Also, use CONVERT to change \`CURRENT\_TIMESTAMP\` into a format 'hh:mi:ss:mmm' (style 114), and then convert this string back into a DATETIME type using the style 114.

  

3\. Apply the PARSE function to interpret the string '02/12/2016' as a DATETIME type, first using the 'en-US' culture (which assumes the format 'mm/dd/yyyy'), and then using the 'en-GB' culture (assuming the format 'dd/mm/yyyy').

  

The goal of this exercise is to understand how CAST, CONVERT, and PARSE can be used for converting between different data types and formats in SQL, and the impact of cultural settings on these conversions.

In [ ]:
-- The CAST, CONVERT and PARSE Functions and their TRY_ Counterparts
SELECT CAST('20160212' AS DATE);
SELECT CAST(SYSDATETIME() AS DATE);
SELECT CAST(SYSDATETIME() AS TIME);

SELECT CONVERT(CHAR(8), CURRENT_TIMESTAMP, 112);
SELECT CONVERT(DATETIME, CONVERT(CHAR(8), CURRENT_TIMESTAMP, 112), 112);

SELECT CONVERT(CHAR(12), CURRENT_TIMESTAMP, 114);
SELECT CONVERT(DATETIME, CONVERT(CHAR(12), CURRENT_TIMESTAMP, 114), 114);

SELECT PARSE('02/12/2016' AS DATETIME USING 'en-US');
SELECT PARSE('02/12/2016' AS DATETIME USING 'en-GB');

Question:

  

Demonstrate your understanding and usage of the \`SWITCHOFFSET\` function in SQL. Perform the following tasks:

  

1\. Write a SQL query using \`SWITCHOFFSET\` to adjust the time zone offset of the current date and time, obtained from \`SYSDATETIMEOFFSET()\`, to '-05:00'. This will simulate changing the current datetime to a time zone that is 5 hours behind UTC.

  

2\. In another query, use \`SWITCHOFFSET\` to modify the time zone offset of the current datetime, also obtained from \`SYSDATETIMEOFFSET()\`, to '+00:00', effectively aligning it with UTC.

  

The objective of these tasks is to illustrate how the \`SWITCHOFFSET\` function can be used to manipulate the time zone offset of datetime values in SQL, allowing for conversions between different time zones.

In [ ]:
-- SWITCHOFFSET
SELECT SWITCHOFFSET(SYSDATETIMEOFFSET(), '-05:00');
SELECT SWITCHOFFSET(SYSDATETIMEOFFSET(), '+00:00');

Question:

  

Demonstrate your proficiency with SQL's datetime functions, specifically focusing on the \`TODATETIMEOFFSET\` function and the \`AT TIME ZONE\` clause. Perform the following tasks:

  

1\. Imagine you have a table \`dbo.T1\` with columns \`dt\` (a DATETIME type) and \`theoffset\` (which stores time zone offsets). Write a hypothetical SQL UPDATE statement that uses the \`TODATETIMEOFFSET\` function to update a column \`dto\` in \`dbo.T1\`. This column should store the datetime from \`dt\` combined with the time zone offset specified in \`theoffset\`. (Note: This is a conceptual task; you don't need to execute the statement on an actual table.)

  

2\. Utilize the \`AT TIME ZONE\` clause in SQL. First, retrieve a list of time zone names, their current UTC offsets, and daylight saving time statuses from the \`sys.time\_zone\_info\` system view. This query will help you understand the available time zones and their attributes in your SQL environment.

  

The aim of these exercises is to deepen your understanding of time zone handling in SQL, specifically how to apply time zone offsets to datetime values and how to work with the built-in time zone information in SQL Server.

In [ ]:
-- TODATETIMEOFFSET
/*
UPDATE dbo.T1
  SET dto = TODATETIMEOFFSET(dt, theoffset);
*/

-- AT TIME ZONE

SELECT name, current_utc_offset, is_currently_dst
FROM sys.time_zone_info;

Question:

  

Showcase your skills in converting non-datetimeoffset values to a specific time zone using SQL. Perform the following task:

  

Write a SQL query to convert two specific datetime strings to the 'Pacific Standard Time' time zone. The first datetime string is '20160212 12:00:00.0000000', and the second is '20160812 12:00:00.0000000'. Use the \`CAST\` function to convert these strings to \`DATETIME2\` type, and then apply the \`AT TIME ZONE\` clause to adjust them to 'Pacific Standard Time'. Label the converted values as \`val1\` and \`val2\` in your query result.

  

This task is aimed at demonstrating how to handle timezone conversions for datetime values that are not originally in the datetimeoffset format, using SQL's time zone conversion capabilities.

In [ ]:
-- Converting non-datetimeoffset values
-- behavior similar to TODATETIMEOFFSET
SELECT
  CAST('20160212 12:00:00.0000000' AS DATETIME2)
    AT TIME ZONE 'Pacific Standard Time' AS val1,
  CAST('20160812 12:00:00.0000000' AS DATETIME2)
    AT TIME ZONE 'Pacific Standard Time' AS val2;

Question:

  

Demonstrate your understanding of converting datetimeoffset values to different time zones using SQL. Perform the following task:

  

Write a SQL query to convert two specific datetimeoffset strings to 'Pacific Standard Time'. The first datetimeoffset string is '20160212 12:00:00.0000000 -05:00', and the second is '20160812 12:00:00.0000000 -04:00'. Use the \`CAST\` function to convert these strings into the \`DATETIMEOFFSET\` type, and then apply the \`AT TIME ZONE\` clause to adjust them to 'Pacific Standard Time'. Label these converted values as \`val1\` and \`val2\` in your query output.

  

This task will help illustrate how to work with timezone adjustments for datetimeoffset values, particularly showing how SQL handles timezone conversions for these types of data.

In [ ]:
-- Converting datetimeoffset values
-- behavior similar to SWITCHOFFSET
SELECT
  CAST('20160212 12:00:00.0000000 -05:00' AS DATETIMEOFFSET)
    AT TIME ZONE 'Pacific Standard Time' AS val1,
  CAST('20160812 12:00:00.0000000 -04:00' AS DATETIMEOFFSET)
    AT TIME ZONE 'Pacific Standard Time' AS val2;

Question:

  

Show your expertise in manipulating dates in SQL using the \`DATEADD\` and \`DATEDIFF\` functions. Execute the following tasks:

  

1\. Use \`DATEADD\` to add one year to the date '20160212'. This will demonstrate how to move a date forward by a specific time interval.

  

2\. Utilize \`DATEDIFF\` to calculate the number of days between '20150212' and '20160212'. This shows how to find the difference between two dates.

  

3\. Apply \`DATEDIFF\_BIG\` to find the difference in milliseconds between '00010101' (the very start of the Common Era) and '20160212'. This function is used for large date range differences that exceed the limits of regular \`DATEDIFF\`.

  

4\. Construct a date that is the same number of days from '19000101' as the difference between '19000101' and the current system date (\`SYSDATETIME()\`). Use a combination of \`DATEDIFF\` and \`DATEADD\` for this.

  

5\. Similarly, construct a date that is the same number of months from '19000101' as the difference between '19000101' and the current system date.

  

6\. Finally, create a date that is the same number of years from '18991231' as the difference between '18991231' and the current system date.

  

These tasks will help you understand how to effectively use \`DATEADD\` and \`DATEDIFF\` to calculate and manipulate dates in SQL, whether it's adding to a date, calculating differences, or creating new dates based on these calculations.

In [ ]:
-- DATEADD
SELECT DATEADD(year, 1, '20160212');

-- DATEDIFF
SELECT DATEDIFF(day, '20150212', '20160212');

SELECT DATEDIFF_BIG(millisecond, '00010101', '20160212');

SELECT
  DATEADD(
    day, 
    DATEDIFF(day, '19000101', SYSDATETIME()), '19000101');

SELECT
  DATEADD(
    month, 
    DATEDIFF(month, '19000101', SYSDATETIME()), '19000101');

SELECT
  DATEADD(
    year, 
    DATEDIFF(year, '18991231', SYSDATETIME()), '18991231');

Question:

  

Demonstrate your proficiency in using a range of SQL date functions by performing the following tasks:

  

1\. Use the \`DATEPART\` function to extract the month part from the date '20160212'. This function helps you retrieve specific components of a date.

  

2\. Write a query to separately extract the day, month, and year from the date '20160212' using the \`DAY\`, \`MONTH\`, and \`YEAR\` functions. Label the outputs as \`theday\`, \`themonth\`, and \`theyear\` respectively.

  

3\. Utilize \`DATENAME\` to retrieve the name of the month and the year from the date '20160212'. This function returns the specific part of the date as a string.

  

4\. Test the validity of two date strings '20160212' and '20160230' using the \`ISDATE\` function. This will help you understand which strings are recognized as valid dates in SQL.

  

5\. Create dates using the \`fromparts\` family of functions. Generate the following:

   - A date using \`DATEFROMPARTS\` with the year 2016, month 02, and day 12.

   - A \`DATETIME2\` value using \`DATETIME2FROMPARTS\` with specified year, month, day, hour, minute, second, and fractional second values.

   - Similarly, create \`DATETIME\`, \`DATETIMEOFFSET\`, \`SMALLDATETIME\`, and \`TIME\` values using \`DATETIMEFROMPARTS\`, \`DATETIMEOFFSETFROMPARTS\`, \`SMALLDATETIMEFROMPARTS\`, and \`TIMEFROMPARTS\` respectively.

  

6\. Use the \`EOMONTH\` function to find the last day of the current month based on the system's current date and time.

  

7\. Finally, write a query to find all orders in the \`Sales.Orders\` table that were placed on the last day of their respective months. Use the \`EOMONTH\` function to compare the \`orderdate\` to the end of the month.

  

These tasks are designed to test your ability to manipulate and query dates in SQL, utilizing a variety of functions to extract, validate, and create date and time values.

In [ ]:
-- DATEPART

SELECT DATEPART(month, '20160212');

-- DAY, MONTH, YEAR

SELECT
  DAY('20160212') AS theday,
  MONTH('20160212') AS themonth,
  YEAR('20160212') AS theyear;

-- DATENAME
SELECT DATENAME(month, '20160212');

SELECT DATENAME(year, '20160212');

-- ISDATE
SELECT ISDATE('20160212');
SELECT ISDATE('20160230');

-- fromparts
SELECT
  DATEFROMPARTS(2016, 02, 12),
  DATETIME2FROMPARTS(2016, 02, 12, 13, 30, 5, 1, 7),
  DATETIMEFROMPARTS(2016, 02, 12, 13, 30, 5, 997),
  DATETIMEOFFSETFROMPARTS(2016, 02, 12, 13, 30, 5, 1, -8, 0, 7),
  SMALLDATETIMEFROMPARTS(2016, 02, 12, 13, 30),
  TIMEFROMPARTS(13, 30, 5, 1, 7);

-- EOMONTH
SELECT EOMONTH(SYSDATETIME());

-- orders placed on last day of month
SELECT orderid, orderdate, custid, empid
FROM Sales.Orders
WHERE orderdate = EOMONTH(orderdate);

```
---------------------------------------------------------------------
-- Querying Metadata
---------------------------------------------------------------------
```

Question:

  

Demonstrate your understanding of SQL Server's metadata by querying the catalog views. Perform the following tasks:

  

1\. First, switch to the \`TSQLV4\` database context using the \`USE\` statement.

  

2\. Write a query against the \`sys.tables\` view to retrieve the schema names and table names of all tables in the current database. In your output, label the schema names as \`table\_schema\_name\` and the table names as \`table\_name\`.

  

3\. Next, target the \`sys.columns\` view to gather detailed information about the columns in the \`Sales.Orders\` table. Your query should return the column names, data types, maximum lengths, collation names, and nullable status of each column. Use the \`OBJECT\_ID\` function to specify the \`Sales.Orders\` table. Label the output appropriately for each column's information, such as \`column\_name\`, \`column\_type\`, etc.

  

The aim of these tasks is to practice accessing and understanding the database's schema and structure information via system catalog views, a crucial skill for database administration and advanced SQL querying.

In [ ]:
-- Catalog Views
USE TSQLV4;

SELECT SCHEMA_NAME(schema_id) AS table_schema_name, name AS table_name
FROM sys.tables;

SELECT 
  name AS column_name,
  TYPE_NAME(system_type_id) AS column_type,
  max_length,
  collation_name,
  is_nullable
FROM sys.columns
WHERE object_id = OBJECT_ID(N'Sales.Orders');

Question:

  

Showcase your skills in retrieving database schema information using Information Schema views in SQL. Execute the following tasks:

  

1\. Write a query that selects the schema and names of all base tables in the database. Use the \`INFORMATION\_SCHEMA.TABLES\` view for this purpose. In your query, ensure that you filter the results to include only those entries where the table type is 'BASE TABLE'. The output should include the columns \`TABLE\_SCHEMA\` and \`TABLE\_NAME\`.

  

2\. Then, focus specifically on the 'Sales.Orders' table. Query the \`INFORMATION\_SCHEMA.COLUMNS\` view to retrieve detailed information about its columns. Your query should list the column name, data type, maximum character length, collation name, and whether the column is nullable. Make sure to filter the results for the schema 'Sales' and the table name 'Orders'. 

  

These tasks will help you understand how to use the Information Schema views to access metadata about the tables and columns in a SQL database, which is essential for database schema exploration and management.

In [ ]:
-- Information Schema Views
SELECT TABLE_SCHEMA, TABLE_NAME
FROM INFORMATION_SCHEMA.TABLES
WHERE TABLE_TYPE = N'BASE TABLE';

SELECT 
  COLUMN_NAME, DATA_TYPE, CHARACTER_MAXIMUM_LENGTH, 
  COLLATION_NAME, IS_NULLABLE
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_SCHEMA = N'Sales'
  AND TABLE_NAME = N'Orders';

Question:

  

Demonstrate your ability to use SQL Server's system stored procedures and functions to gather detailed information about database objects. Complete the following tasks:

  

1\. Execute the \`sys.sp\_tables\` stored procedure to list all tables and views in the current database, along with other relevant information about these objects.

  

2\. Use the \`sys.sp\_help\` stored procedure, specifying \`@objname = N'Sales.Orders'\`, to obtain detailed information about the 'Sales.Orders' table, including its structure, columns, and indexes.

  

3\. Execute the \`sys.sp\_columns\` stored procedure with \`@table\_name = N'Orders'\` and \`@table\_owner = N'Sales'\` to get comprehensive information about the columns in the 'Sales.Orders' table, such as data types and nullability.

  

4\. Retrieve the constraints defined on the 'Sales.Orders' table by running the \`sys.sp\_helpconstraint\` stored procedure, again specifying the object name as \`N'Sales.Orders'\`.

  

5\. Use the \`SERVERPROPERTY\` function to find out the product level of the SQL Server instance you are connected to.

  

6\. Discover the collation setting of the 'TSQLV4' database by using the \`DATABASEPROPERTYEX\` function.

  

7\. Check if the 'Sales.Orders' table has a primary key by utilizing the \`OBJECTPROPERTY\` function with the 'TableHasPrimaryKey' property.

  

8\. Finally, determine if the 'shipcountry' column in the 'Sales.Orders' table allows NULL values by using the \`COLUMNPROPERTY\` function.

  

These tasks will help you navigate and understand the extensive metadata about database objects available through SQL Server's system stored procedures and functions, which are vital for database administration and schema analysis.

In [ ]:
-- System Stored Procedures and Functions
EXEC sys.sp_tables;

EXEC sys.sp_help
  @objname = N'Sales.Orders';

EXEC sys.sp_columns
  @table_name = N'Orders',
  @table_owner = N'Sales';

EXEC sys.sp_helpconstraint
  @objname = N'Sales.Orders';

SELECT 
  SERVERPROPERTY('ProductLevel');

SELECT
  DATABASEPROPERTYEX(N'TSQLV4', 'Collation');

SELECT 
  OBJECTPROPERTY(OBJECT_ID(N'Sales.Orders'), 'TableHasPrimaryKey');

SELECT
  COLUMNPROPERTY(OBJECT_ID(N'Sales.Orders'), N'shipcountry', 'AllowsNull');